astb_relise/src/InformationRegisters/СоответствиеКонтрагентовДляУчетаЧистки/СоответствиеКонтрагентовДляУчетаЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеКонтрагентовДляУчетаЧистки</name>
  <comment>№ 129093</comment>
  <resources>
    <name>ПередачаКонтрагентОтравитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ПередачаКонтрагентПолучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратКонтрагентОтравитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратКонтрагентПолучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/СоответствиеКонтрагентовДляУчетаЧистки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция КонтрагентыДляУчетаЧисткиСИЗ(Организация) Экспорт 
	
	//***НСК Трегубов А.А.*** -- № 129093 Доработка чистки (контрагенты по молчанию) --  18.10.2021 <<<
	
	СтруктураКонтрагентов = Новый Структура;
	СтруктураКонтрагентов.Вставить("ПередачаКонтрагентОтравитель",Справочники.Контрагенты.ПустаяСсылка());
	СтруктураКонтрагентов.Вставить("ПередачаКонтрагентПолучатель",Справочники.Контрагенты.ПустаяСсылка());
	СтруктураКонтрагентов.Вставить("ВозвратКонтрагентОтравитель", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураКонтрагентов.Вставить("ВозвратКонтрагентПолучатель", Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеКонтрагентовДляУчетаЧистки.ПередачаКонтрагентОтравитель КАК ПередачаКонтрагентОтравитель,
	|	СоответствиеКонтрагентовДляУчетаЧистки.ПередачаКонтрагентПолучатель КАК ПередачаКонтрагентПолучатель,
	|	СоответствиеКонтрагентовДляУчетаЧистки.ВозвратКонтрагентОтравитель КАК ВозвратКонтрагентОтравитель,
	|	СоответствиеКонтрагентовДляУчетаЧистки.ВозвратКонтрагентПолучатель КАК ВозвратКонтрагентПолучатель
	|ИЗ
	|	РегистрСведений.СоответствиеКонтрагентовДляУчетаЧистки КАК СоответствиеКонтрагентовДляУчетаЧистки
	|ГДЕ
	|	СоответствиеКонтрагентовДляУчетаЧистки.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаРезультат = РезультатЗапроса.Выбрать();
	
	Если ВыборкаРезультат.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураКонтрагентов,ВыборкаРезультат);
	КонецЕсли;
	
	Возврат СтруктураКонтрагентов;
	
КонецФункции // КонтрагентыДляУчетаЧисткиСИЗ()


#КонецЕсли
